---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.VertexFormat
source: html/93f46cc7-73a5-e957-2ecd-ab7e125324a2.htm
---
# VertexFormat Members

Constructs the specification of vertex format from a numerical representation.